Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/witnesses/witnesses_introduction.html.txt.tmx
Source language: en
Languages: ga

source: If you have been called as a witness in a trial your main duty as a witness is to tell the truth
ga: Má tá tú glaoite go dtí a bheith ina fhinné i dtriail Is é do dhualgas príomh mar fhinné an fhírinne a insint

source: If a judge forms the opinion that you have lied under oath, you may be prosecuted for perjury
ga: Má cheapann breitheamh go bhfuil bréaga insithe agat faoi mhionn, d'fhéadfadh sé/sí an dlí a chur ort as fianaise bhréige a thabhairt é

source: In this section, you will find information about what it means to be a witness in a court case
ga: Sa rannóg seo gheobhaidh tú eolas maidir le bheith i d’fhinné i gcás cúirte

source: There is information on the different types of witness, who is competent to be a witness (i.e., who is capable of being a witness), and who can be compelled to be a witness
ga: Breathnófar ar na cineálacha finnéithe éagsúla, cé atá inniúil ar bheith ina f(h)inné (i.e., cé atá ábalta ar bheith ina f(h)inné) agus cé na daoine gur féidir iallach a chur orthu a bheith ina bhfinnéithe

source: You will also find information about how you are called to be a witness, the procedure for witness service and theprocedures in place for witnesses under 18 years
ga: Tá eolas ar fáil freisin maidir leis an chaoi a nglaotar ar dhuine le bheith ina f(h)inné, an modh oibre atá ag an tseirbhís fhinné agus na socruithe a bhaineann le finnéithe atá faoi ocht mbliana déag d'aois

source: It also covers when you may give evidence by video-link and what the rules are in relation to the evidence you can give
ga: Breathnófar ar na hamanna inár féidir fianaise a thabhairt le nasc físe agus cé na rialacha a bhaineann leis an bhfianaise gur féidir leat a thabhairt

source: Information on going to court as a witness is also available in a Director of Public Prosecutions (DPP) booklet
ga: Tá eolas ar fáil freisin maidir le dul chuig an gcúirt mar fhinné sna leabhrán an Stiúrthóra Ionchúiseamh Poiblí

source: For more detailed information you should seek legal advice
ga: Ba chóir duit comhairle dlí a lorg chun faisnéis mionsonraithe a fháil
